Repository: 262media/validated-field-for-acf
Catalog: languages/acf_vf-*.po
Languages: pt_br

source: Enable Debug
pt_br: Habilitar Depuração

source: Check this box to turn on debugging for Validated Fields.
pt_br: Marque esta opção para ativar a depuração para Campos Validados.

source: Enable Draft Validation
pt_br: Habilitar Rascunho de Validação

source: Check this box to enable Draft validation globally, or uncheck to allow it to be set per field.
pt_br: Marque esta opção para ativar o rascunho de validação a nível global, o desmarque para permitir que seja configurado por campo.

source: Enable Front-End Validation
pt_br: Habilitar validação Front-End

source: Check this box to turn on validation for front-end forms created with
pt_br: Marque esta opção para ativar a validação de formulários criados com

source: Enqueue Admin CSS on Front-End
pt_br: Enqueue o CSS administrativo no Front-End

source: Uncheck this box to turn off "colors-fresh" admin theme enqueued by
pt_br: Desmarque esta opção para desativar o tema administrativo "colors-fresh" enfileirado por

source: Validated Field
pt_br: Campo Validado

source: Basic
pt_br: Básico

source: Validation failed.
pt_br: Erro de validação.

source: Validated Field Settings
pt_br: Configuração de Campo Validado

source: This field's validation is not properly configured.
pt_br: A validação deste campo não está configurada corretamente.

source: The value
pt_br: O valor

source: is already in use by
pt_br: já está sendo usado por

source: Read Only?
pt_br: Somente leitura?

source: Yes
pt_br: Sim

source: No
pt_br: Não

source: Validate Drafts/Preview?
pt_br: Validar Rascunhos/Visualizações?

source: Warning
pt_br: Aviso

source: has been set to <code>false</code> which overrides field level configurations
pt_br: foi definido para <code>false</code> que substitui configurações a nível de campo

source: Field Type
pt_br: Tipo de Campo

source: Input Mask
pt_br: Máscara de Entrada

source: Use &#39;a&#39; to match A-Za-z, &#39;9&#39; to match 0-9, and &#39;*&#39; to match any alphanumeric.
pt_br: Use &#39;a&#39; para corresponder com &#39;A-Za-z&#39;, '&#39;9&#39; para corresponder com 0-9, e &#39;*&#39; para corresponder a qualquer alfanumérico.

source: More info
pt_br: Mais informações

source: Input masking is not compatible with the "number" field type!
pt_br: Máscaras de entrada não são compatíveis com o tipo de campo "number"!

source: Validation: Function
pt_br: Validação: Função

source: How should the field be server side validated?
pt_br: Como deve ser a validação do campo no servidor?

source: None
pt_br: Nenhuma

source: Regular Expression
pt_br: Expressão Regular

source: PHP Statement
pt_br: Declaração de PHP

source: Validation: Pattern
pt_br: Validação: Modelo

source: Pattern match the input using
pt_br: O modelo deve coincidir com a entrada usando

source: Use any PHP code and return true or false. If nothing is returned it will evaluate to true.
pt_br: Usar qualquer código PHP e retornar verdadeiro ou falso. Se nada é retornado, a validação será verdadeira.

source: Available variables
pt_br: Variáveis disponíveis

source: returned to UI
pt_br: retornado para a interface de usuário

source: Example
pt_br: Exemplo

source: Validation: Error Message
pt_br: Validação: Mensagem de erro

source: Unique Value?
pt_br: Valor único?

source: Make sure this value is unique for...
pt_br: Certifique-se de que este valor é único para...

source: Non-Unique Value
pt_br: Valor não único

source: Unique Globally
pt_br: Único Globalmente

source: Unique For Post Type
pt_br: Único para o tipo de post

source: Field/Meta Key
pt_br: Campo / Meta key

source: Unique Value: Apply to...?
pt_br: Valor Único: Aplicar a ...?

source: Read only
pt_br: Somente leitura

source: Validation successful
pt_br: Validação bem sucedida

source: Validation failed
pt_br: A validação falhou

source: Please check your values and submit again.
pt_br: Por favor, verifique seus valroes e tente novamente.

source: was submitted multiple times and should be unique for
pt_br: foi enviado várias vezes e deve ser único para

source: When a field is marked read only, it will be visible but uneditable. Read only fields are marked with
pt_br: Quando um campo está marcado apenas para leitura, ele será visível, mas não editável. Campos "somente leitura" estão marcados com

source: The underlying field type that you would like to validate.
pt_br: O tipo de campo subjacente que vocÊ gostaria de validar.

source: Input mask
pt_br: Máscara de entrada

source: Input Mask: Autoclear
pt_br: Máscara de entrada: Autoclear

source: Clear values that do match the input mask, if provided.
pt_br: Valores claros que fazem corresponder com a máscara de entrada, se fornecida.

source: Input Mask: Placeholder
pt_br: Máscara de entrada: Placeholder

source: Use this string or character as a placeholder for the input mask.
pt_br: Use esta string ou caractere como um placeholder para a máscara de entrada.

source: Use any PHP code and return true for success or false for failure. If nothing is returned it will evaluate to true.
pt_br: Usar qualquer código PHP e retornar verdadeiro ou falso. Se nada é retornado, a validação será verdadeira.

source: Pattern
pt_br: Modelo

source: The default error message that is returned to the client.
pt_br: A mensagem de erro padrão que é retornada ao cliente.

source: Unique For Post
pt_br: Único para o post

source: Make sure this value is unique for the checked post statuses.
pt_br: Certifique-se de que este valor é único para os status de post marcados.
